In [1]:
import pandas as pd

In [9]:
# company.txt file is downloaded from sec website
df = pd.read_csv('company.txt', sep='\t', names=['ticker', 'cik'])
df.shape

(10289, 2)

In [10]:
df

      ticker      cik
0       aapl   320193
1       amzn  1018724
2       msft   789019
3       goog  1652044
4       baba  1577552
...      ...      ...
10284   ctbb    68622
10285  cssen  1679063
10286  ctxrw  1506251
10287    ctz    68622
10288    ctv    68622

[10289 rows x 2 columns]

# If you want to find out the updated list, it is better to download the list from website directly as below

In [11]:
df2 = pd.read_json('https://www.sec.gov/files/company_tickers.json')

In [13]:
df2 = df2.transpose()
df2

       cik_str ticker                        title
0       320193   AAPL                   Apple Inc.
1      1018724   AMZN               AMAZON COM INC
2       789019   MSFT               MICROSOFT CORP
3      1652044   GOOG                Alphabet Inc.
4      1577552   BABA    Alibaba Group Holding Ltd
...        ...    ...                          ...
10284  1279704  CLRBZ  Cellectar Biosciences, Inc.
10285  1287032    PBC        PROSPECT CAPITAL CORP
10286  1283699  TMUSR            T-Mobile US, Inc.
10287  1293310  HGEND               HUMANIGEN, INC
10288  1293818  OPGNW                    OPGEN INC

[10289 rows x 3 columns]

In [19]:
# Filter the compay who has Alphabet word in the company name
df2[df2['title'].str.contains('Alphabet')]

      cik_str ticker          title
3     1652044   GOOG  Alphabet Inc.
8237  1652044  GOOGL  Alphabet Inc.